import React from 'react'
import "./advantages.scss"

const Advantages = () => {
    return (
        <section className="advantages">
            <div className="advantages-inner">
                <h2 className="advantages-title">
                    Магазин Глейси – это онлайн и офлайн-магазин по продаже<br />
                    мороженого собственного проиводства на развес
                </h2>
                <ul className="advantages-list">
                    <li className="advantages-item">
                        <svg className="advantages-icon" aria-hidden="true" focusable="false" width="16" height="32" viewBox="0 0 16 32" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M8 0a8 8 0 0 0-8 7v16h16V7a8 8 0 0 0-8-7Zm6.1 21H2v-8.6a1.7 1.7 0 0 0 1.4.6c1.2 0 2-.7 2-1.5v-.9a.8.8 0 1 1 1.6 0v3.1a1.8 1.8 0 0 0 2 1.8 1.8 1.8 0 0 0 2-1.7v-2a1.3 1.3 0 1 1 2.6 0 1 1 0 0 0 .6.8v8.5ZM6.6 30.6a1.4 1.4 0 1 0 2.8 0v-6.7H6.6v6.7Z"
                            fill="#2D3440" /></svg>
                        <p className="advantages-description">
                            Всё наше мороженое изготавливается на собственном<br />
                            производстве с использованием современного<br />
                            оборудования и проверенных временем технологий.
                        </p>
                    </li>
                    <li className="advantages-item">
                        <svg className="advantages-icon" aria-hidden="true" focusable="false" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M26.7 10.3a12.1 12.1 0 0 0 .5-9.6 1 1 0 0 0-.3-.4 1 1 0 0 0-1.6.3c-1.3 2.2-4.2 6-6.2 6H19l-3-.2c-1 0-1.9.1-2.9.3C11 6.5 8 2.8 6.8.6a1 1 0 0 0-.4-.5 1 1 0 0 0-1.2.1 1 1 0 0 0-.4.5 12 12 0 0 0 .5 9.6c-1.9.2-4.2.8-5 2.2a2.1 2.1 0 0 0 0 2.2c.2.4.6.7 1 1l1.4.3c.9 0 1.7-.2 2.6-.5V17a34.4 34.4 0 0 0 2.4 6.6L7 26.2a4.3 4.3 0 0 0 1.2 3.3c1.5 1.7 4.2 2.5 8 2.5 3.7 0 6.4-.8 7.9-2.5a4.4 4.4 0 0 0 1.1-3.3c-.2-.9-.4-1.7-.8-2.5l.6-1.4c.7-1.7 1.3-3.4 1.8-5.2l.1-1.6c.8.3 1.6.4 2.5.5.4 0 1-.1 1.4-.3.4-.3.8-.6 1-1a2.1 2.1 0 0 0 0-2.2c-.8-1.4-3.1-2-5-2.2Zm-1-6.7c.4 2.1 0 4.3-1 6.2A7.5 7.5 0 0 0 22 7.7c1.5-1.2 2.8-2.6 3.9-4.1Zm-19.4 0a17 17 0 0 0 3.8 4c-.7.3-1.4.8-2 1.3l-.8.9c-1-2-1.4-4-1-6.2ZM2.2 13.7c-.1-.1 0-.2 0-.2.2-.4 1.4-1 3.7-1.3l-.3 1c-1.3.6-3.1 1-3.4.5Zm22.4 3a33.3 33.3 0 0 1-2.4 6.8v.6c.4.7.7 1.5.9 2.3a2.3 2.3 0 0 1-.7 1.8c-.7.8-2.5 1.8-6.4 1.8-3.9 0-5.6-1-6.3-1.8-.5-.5-.7-1.1-.7-1.8l.8-2.3.1-.3v-.3a16 16 0 0 0-.7-2c-.7-1.5-1.3-3.1-1.8-4.8a7 7 0 0 1 2.3-6.4c1.5-1.5 5-1.9 6.3-1.9 1.3 0 4.7.4 6.4 2a7.1 7.1 0 0 1 2.2 6.3Zm5.2-3c-.2.5-2 .1-3.3-.6l-.3-.9c2.2.3 3.4.9 3.7 1.3v.2Z"
                            fill="#2D3440" /></svg>
                        <p className="advantages-description">
                            Закупка ингредиентов производится только<br />
                            у проверенных фермерских хозяйств, с которыми<br />
                            нас связывает долговременное сотрудничество.
                        </p>
                    </li>
                    <li className="advantages-item">
                        <svg className="advantages-icon" aria-hidden="true" focusable="false" width="20" height="32" viewBox="0 0 20 32" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M19.3 18.5C19 9.5 11 .6 10.7.2h-.2l-.1-.2h-.7l-.2.1-.1.1C9 .6 1 9.4.7 18.5v1.2a13 13 0 0 0 9 12.3h.5c.1 0 8.8-2.5 9.1-12.3v-1.2ZM3.1 15c1.8 1.7 3.8 3 6 4v4.3c-2.2-1.2-5.6-3.2-6.6-5 0-1.1.2-2.2.5-3.3Zm1.8-4.8C6 11.6 7.5 12.6 9 13.2v3.7c-2-.9-3.9-2.2-5.4-3.8.3-1 .7-2 1.2-2.8ZM16.4 13c-1.6 1.7-3.5 3-5.5 3.8v-3.7c1.6-.6 3-1.6 4.2-3l1.3 2.9Zm-5.5-2V3.6c1.2 1.6 2.3 3.2 3.3 5-.8 1.1-2 2-3.3 2.6Zm0 12.3v-4.3c2.2-1 4.3-2.3 6.1-4 .3 1.1.5 2.2.5 3.3-1 1.8-4.4 3.8-6.6 5ZM9.1 11.2a8.2 8.2 0 0 1-3.3-2.7c1-1.8 2-3.5 3.3-5v7.7ZM2.7 21.4c2 1.7 4.1 3 6.4 4.1v4.2c-1.6-.7-3-1.8-4.2-3.3a11.5 11.5 0 0 1-2.2-5Zm8.2 8.3v-4.2c2.3-1 4.5-2.4 6.4-4-.3 1.8-1 3.5-2.2 5a10.5 10.5 0 0 1-4.2 3.2Z"
                            fill="#2D3440" /></svg>
                        <p className="advantages-description">
                            Для приготовления мороженого используются сливки<br />
                            и молоко высочайшего качества. Все ингредиенты<br />
                            и добавки произведены из натурального сырья.
                        </p>
                    </li>
                    <li className="advantages-item">
                        <svg className="advantages-icon" aria-hidden="true" focusable="false" width="19" height="32" viewBox="0 0 19 32" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11.19 5.07a5.3 5.3 0 0 0-1.37-3.59A4.49 4.49 0 0 0 6.52 0C5.28 0 4.1.53 3.22 1.48a5.3 5.3 0 0 0-1.36 3.59v14.75A7.69 7.69 0 0 0 .79 28.2a7 7 0 0 0 2.17 2.6 6.14 6.14 0 0 0 6.25.62c1-.46 1.89-1.19 2.57-2.12a7.78 7.78 0 0 0 1.13-6.7 7.3 7.3 0 0 0-1.72-2.98V5.07Zm.17 19.72c0 .88-.2 1.75-.58 2.52a5.02 5.02 0 0 1-1.63 1.9 4.5 4.5 0 0 1-4.62.28 4.88 4.88 0 0 1-1.82-1.68 5.44 5.44 0 0 1-.47-5c.32-.8.83-1.51 1.47-2.05V5.06c0-.8.3-1.58.82-2.15a2.7 2.7 0 0 1 2-.9c.74 0 1.45.33 1.98.9.53.57.82 1.35.82 2.16v15.5c.63.47 1.14 1.1 1.5 1.84.35.74.53 1.55.53 2.38Z" fill="#2D3440" /><path d="M7.53 21.64V5.14c0-.27-.1-.52-.27-.71a.9.9 0 0 0-.65-.3.9.9 0 0 0-.66.3c-.17.19-.27.44-.27.71v16.5c-.62.24-1.14.7-1.47 1.32a3.25 3.25 0 0 0 .6 3.84c.5.46 1.14.71 1.8.71.65 0 1.29-.25 1.79-.7a3.25 3.25 0 0 0 .6-3.84 2.85 2.85 0 0 0-1.47-1.33ZM18.67 3.94H13.1v2.02h5.57V3.94ZM18.67 7.97H13.1V10h5.57V7.97ZM18.67 12H13.1v2.02h5.57V12ZM18.67 16.03H13.1v2.02h5.57v-2.02Z"
                            fill="#2D3440" /></svg>
                        <p className="advantages-description">
                            Доставка нашего мороженого осуществляется в
                            специальном термопаке, который не даёт мороженому
                            растаять и позволяет сохранить превосходный вкус.
                        </p>
                    </li>
                </ul>
            </div>
        </section>

    )
}

export default Advantages